# St7PlateOffsetByThickness

Offsets selected plate elements to one of the plate surfaces, based on the plate thickness.

Strand7 API Manual

long St7PlateOffsetByThickness(long uID, long Surface)

Input Parameters

uID

Strand7 model file ID.

Surface

One of psPlateMidPlane, psPlateMinusZ or psPlatePlusZ.

Dependencies
Selection

Plates can be selected using functions in Entity Selection.

Keep Selected

Assigned using St7SetKeepSelect.